tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf46j50_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18LF46J50_H_
#define _PIC18LF46J50_H_

#define PPSCON                        0
#define IOLOCK                        1
#define UEP0                          2
#define UEP0_EPSTALL                  3
#define EP0STALL                      4
#define EPSTALL0                      5
#define UEP0_EPINEN                   6
#define EPINEN0                       7
#define EP0INEN                       8
#define UEP0_EPOUTEN                  9
#define EP0OUTEN                      10
#define EPOUTEN0                      11
#define EPCONDIS0                     12
#define EP0CONDIS                     13
#define UEP0_EPCONDIS                 14
#define UEP0_EPHSHK                   15
#define EP0HSHK                       16
#define EPHSHK0                       17
#define UEP1                          18
#define EPSTALL1                      19
#define EP1STALL                      20
#define UEP1_EPSTALL                  21
#define EPINEN1                       22
#define EP1INEN                       23
#define UEP1_EPINEN                   24
#define EPOUTEN1                      25
#define UEP1_EPOUTEN                  26
#define EP1OUTEN                      27
#define UEP1_EPCONDIS                 28
#define EP1CONDIS                     29
#define EPCONDIS1                     30
#define EPHSHK1                       31
#define EP1HSHK                       32
#define UEP1_EPHSHK                   33
#define UEP2                          34
#define EP2STALL                      35
#define EPSTALL2                      36
#define UEP2_EPSTALL                  37
#define EP2INEN                       38
#define EPINEN2                       39
#define UEP2_EPINEN                   40
#define EP2OUTEN                      41
#define UEP2_EPOUTEN                  42
#define EPOUTEN2                      43
#define EP2CONDIS                     44
#define UEP2_EPCONDIS                 45
#define EPCONDIS2                     46
#define EP2HSHK                       47
#define EPHSHK2                       48
#define UEP2_EPHSHK                   49
#define UEP3                          50
#define UEP3_EPSTALL                  51
#define EPSTALL3                      52
#define EP3STALL                      53
#define UEP3_EPINEN                   54
#define EPINEN3                       55
#define EP3INEN                       56
#define EP3OUTEN                      57
#define EPOUTEN3                      58
#define UEP3_EPOUTEN                  59
#define UEP3_EPCONDIS                 60
#define EP3CONDIS                     61
#define EPCONDIS3                     62
#define EPHSHK3                       63
#define UEP3_EPHSHK                   64
#define EP3HSHK                       65
#define UEP4                          66
#define EP4STALL                      67
#define EPSTALL4                      68
#define UEP4_EPSTALL                  69
#define UEP4_EPINEN                   70
#define EP4INEN                       71
#define EPINEN4                       72
#define UEP4_EPOUTEN                  73
#define EPOUTEN4                      74
#define EP4OUTEN                      75
#define EPCONDIS4                     76
#define EP4CONDIS                     77
#define UEP4_EPCONDIS                 78
#define EPHSHK4                       79
#define EP4HSHK                       80
#define UEP4_EPHSHK                   81
#define UEP5                          82
#define EP5STALL                      83
#define UEP5_EPSTALL                  84
#define EPSTALL5                      85
#define EPINEN5                       86
#define UEP5_EPINEN                   87
#define EP5INEN                       88
#define EPOUTEN5                      89
#define UEP5_EPOUTEN                  90
#define EP5OUTEN                      91
#define EPCONDIS5                     92
#define EP5CONDIS                     93
#define UEP5_EPCONDIS                 94
#define UEP5_EPHSHK                   95
#define EPHSHK5                       96
#define EP5HSHK                       97
#define UEP6                          98
#define EPSTALL6                      99
#define UEP6_EPSTALL                  100
#define EP6STALL                      101
#define EP6INEN                       102
#define UEP6_EPINEN                   103
#define EPINEN6                       104
#define EP6OUTEN                      105
#define EPOUTEN6                      106
#define UEP6_EPOUTEN                  107
#define UEP6_EPCONDIS                 108
#define EP6CONDIS                     109
#define EPCONDIS6                     110
#define EPHSHK6                       111
#define UEP6_EPHSHK                   112
#define EP6HSHK                       113
#define UEP7                          114
#define UEP7_EPSTALL                  115
#define EP7STALL                      116
#define EPSTALL7                      117
#define EP7INEN                       118
#define EPINEN7                       119
#define UEP7_EPINEN                   120
#define EP7OUTEN                      121
#define UEP7_EPOUTEN                  122
#define EPOUTEN7                      123
#define UEP7_EPCONDIS                 124
#define EP7CONDIS                     125
#define EPCONDIS7                     126
#define EPHSHK7                       127
#define UEP7_EPHSHK                   128
#define EP7HSHK                       129
#define UEP8                          130
#define EPSTALL8                      131
#define UEP8_EPSTALL                  132
#define UEP8_EPINEN                   133
#define EPINEN8                       134
#define UEP8_EPOUTEN                  135
#define EPOUTEN8                      136
#define UEP8_EPCONDIS                 137
#define EPCONDIS8                     138
#define UEP8_EPHSHK                   139
#define EPHSHK8                       140
#define UEP9                          141
#define EPSTALL9                      142
#define UEP9_EPSTALL                  143
#define EPINEN9                       144
#define UEP9_EPINEN                   145
#define UEP9_EPOUTEN                  146
#define EPOUTEN9                      147
#define UEP9_EPCONDIS                 148
#define EPCONDIS9                     149
#define UEP9_EPHSHK                   150
#define EPHSHK9                       151
#define UEP10                         152
#define EPSTALL10                     153
#define UEP10_EPSTALL                 154
#define EPINEN10                      155
#define UEP10_EPINEN                  156
#define UEP10_EPOUTEN                 157
#define EPOUTEN10                     158
#define EPCONDIS10                    159
#define UEP10_EPCONDIS                160
#define UEP10_EPHSHK                  161
#define EPHSHK10                      162
#define UEP11                         163
#define UEP11_EPSTALL                 164
#define EPSTALL11                     165
#define EPINEN11                      166
#define UEP11_EPINEN                  167
#define UEP11_EPOUTEN                 168
#define EPOUTEN11                     169
#define EPCONDIS11                    170
#define UEP11_EPCONDIS                171
#define UEP11_EPHSHK                  172
#define EPHSHK11                      173
#define UEP12                         174
#define EPSTALL12                     175
#define UEP12_EPSTALL                 176
#define UEP12_EPINEN                  177
#define EPINEN12                      178
#define EPOUTEN12                     179
#define UEP12_EPOUTEN                 180
#define EPCONDIS12                    181
#define UEP12_EPCONDIS                182
#define EPHSHK12                      183
#define UEP12_EPHSHK                  184
#define UEP13                         185
#define UEP13_EPSTALL                 186
#define EPSTALL13                     187
#define EPINEN13                      188
#define UEP13_EPINEN                  189
#define UEP13_EPOUTEN                 190
#define EPOUTEN13                     191
#define EPCONDIS13                    192
#define UEP13_EPCONDIS                193
#define EPHSHK13                      194
#define UEP13_EPHSHK                  195
#define UEP14                         196
#define UEP14_EPSTALL                 197
#define EPSTALL14                     198
#define EPINEN14                      199
#define UEP14_EPINEN                  200
#define UEP14_EPOUTEN                 201
#define EPOUTEN14                     202
#define EPCONDIS14                    203
#define UEP14_EPCONDIS                204
#define UEP14_EPHSHK                  205
#define EPHSHK14                      206
#define UEP15                         207
#define UEP15_EPSTALL                 208
#define EPSTALL15                     209
#define UEP15_EPINEN                  210
#define EPINEN15                      211
#define UEP15_EPOUTEN                 212
#define EPOUTEN15                     213
#define EPCONDIS15                    214
#define UEP15_EPCONDIS                215
#define UEP15_EPHSHK                  216
#define EPHSHK15                      217
#define UIE                           218
#define URSTIE                        219
#define UERRIE                        220
#define ACTVIE                        221
#define TRNIE                         222
#define IDLEIE                        223
#define STALLIE                       224
#define SOFIE                         225
#define UEIE                          226
#define PIDEE                         227
#define CRC5EE                        228
#define CRC16EE                       229
#define DFN8EE                        230
#define BTOEE                         231
#define BTSEE                         232
#define UADDR                         233
#define ADDR                          234
#define ADDR0                         235
#define ADDR1                         236
#define ADDR2                         237
#define ADDR3                         238
#define ADDR4                         239
#define ADDR5                         240
#define ADDR6                         241
#define UCFG                          242
#define UPP0                          243
#define PPB0                          244
#define UPP1                          245
#define PPB1                          246
#define FSEN                          247
#define UTRDIS                        248
#define UPUEN                         249
#define UOEMON                        250
#define UTEYE                         251
#define PADCFG1                       252
#define PMPTTL                        253
#define RTSECSEL0                     254
#define RTSECSEL1                     255
#define REFOCON                       256
#define RODIV0                        257
#define RODIV                         258
#define RODIV1                        259
#define RODIV2                        260
#define RODIV3                        261
#define ROSEL                         262
#define ROSSLP                        263
#define ROON                          264
#define RTCCAL                        265
#define CAL0                          266
#define CAL                           267
#define CAL1                          268
#define CAL2                          269
#define CAL3                          270
#define CAL4                          271
#define CAL5                          272
#define CAL6                          273
#define CAL7                          274
#define RTCCFG                        275
#define RTCPTR0                       276
#define RTCPTR1                       277
#define RTCOE                         278
#define HALFSEC                       279
#define RTCSYNC                       280
#define RTCWREN                       281
#define RTCEN                         282
#define ODCON3                        283
#define SPI1OD                        284
#define SPI2OD                        285
#define ODCON2                        286
#define U1OD                          287
#define U2OD                          288
#define ODCON1                        289
#define ECCP1OD                       290
#define ECCP2OD                       291
#define ANCON0                        292
#define PCFG0                         293
#define PCFG1                         294
#define PCFG2                         295
#define PCFG3                         296
#define PCFG4                         297
#define PCFG5                         298
#define PCFG6                         299
#define PCFG7                         300
#define ANCON1                        301
#define PCFG8                         302
#define PCFG9                         303
#define PCFG10                        304
#define PCFG11                        305
#define PCFG12                        306
#define PCFG14                        307
#define VBG2EN                        308
#define PCFG15                        309
#define VBGEN                         310
#define DSWAKEL                       311
#define DSPOR                         312
#define DSMCLR                        313
#define DSRTC                         314
#define DSWDT                         315
#define DSULP                         316
#define DSFLT                         317
#define DSWAKEH                       318
#define DSINT0                        319
#define DSCONL                        320
#define RELEASE                       321
#define DSBOR                         322
#define ULPWDIS                       323
#define DSCONH                        324
#define RTCWDIS                       325
#define DSULPEN                       326
#define DSEN                          327
#define DSGPR0                        328
#define DSGPR1                        329
#define TCLKCON                       330
#define T3CCP1                        331
#define T3CCP2                        332
#define T1RUN                         333
#define CVRCON                        334
#define CVR                           335
#define CVR0                          336
#define CVR1                          337
#define CVR2                          338
#define CVR3                          339
#define CVRSS                         340
#define CVRR                          341
#define CVROEN                        342
#define CVROE                         343
#define CVREN                         344
#define PMSTATL                       345
#define OB0E                          346
#define OB1E                          347
#define OB2E                          348
#define OB3E                          349
#define OBUF                          350
#define OBE                           351
#define PMSTATH                       352
#define IB0F                          353
#define IB1F                          354
#define IB2F                          355
#define IB3F                          356
#define IBOV                          357
#define IBF                           358
#define PMEL                          359
#define PTEN0                         360
#define PTENL                         361
#define PTEN1                         362
#define PTEN2                         363
#define PTEN3                         364
#define PTEN4                         365
#define PTEN5                         366
#define PTEN6                         367
#define PTEN7                         368
#define PMEH                          369
#define PTEN8                         370
#define PTENH                         371
#define PTEN9                         372
#define PTEN10                        373
#define PTEN11                        374
#define PTEN12                        375
#define PTEN13                        376
#define PTEN14                        377
#define PTEN15                        378
#define PMDIN2L                       379
#define PMDIN2L_DATAL                 380
#define PMDIN2H                       381
#define PMDIN2H_DATAH                 382
#define PMDOUT2L                      383
#define PMDOUT2L_DATAL                384
#define PMDOUT2H                      385
#define PMDOUT2H_DATAH                386
#define PMMODEL                       387
#define WAITE                         388
#define PMMODEL_WAITE0                389
#define PMMODEL_WAITE1                390
#define PMMODEL_WAITM0                391
#define WAITM                         392
#define PMMODEL_WAITM1                393
#define PMMODEL_WAITM2                394
#define PMMODEL_WAITM3                395
#define PMMODEL_WAITB0                396
#define WAITB                         397
#define PMMODEL_WAITB1                398
#define PMMODEH                       399
#define MODE0                         400
#define MODE1                         401
#define MODE16                        402
#define INCM0                         403
#define INCM1                         404
#define IRQM0                         405
#define IRQM1                         406
#define BUSY                          407
#define PMCONL                        408
#define RDSP                          409
#define WRSP                          410
#define BEP                           411
#define CS1P                          412
#define CS2P                          413
#define ALP                           414
#define CSF0                          415
#define CSF1                          416
#define PMCONH                        417
#define PTRDEN                        418
#define PTWREN                        419
#define PTBEEN                        420
#define ADRMUX0                       421
#define ADRMUX1                       422
#define PSIDL                         423
#define PMPEN                         424
#define UFRML                         425
#define FRML                          426
#define FRM0                          427
#define UFRML_FRM                     428
#define FRM1                          429
#define FRM2                          430
#define FRM3                          431
#define FRM4                          432
#define FRM5                          433
#define FRM6                          434
#define FRM7                          435
#define UFRMH                         436
#define FRM8                          437
#define UFRMH_FRM                     438
#define FRM9                          439
#define FRM10                         440
#define UIR                           441
#define URSTIF                        442
#define UERRIF                        443
#define ACTVIF                        444
#define TRNIF                         445
#define IDLEIF                        446
#define STALLIF                       447
#define SOFIF                         448
#define UEIR                          449
#define PIDEF                         450
#define CRC5EF                        451
#define CRC16EF                       452
#define DFN8EF                        453
#define BTOEF                         454
#define BTSEF                         455
#define USTAT                         456
#define PPBI                          457
#define DIR                           458
#define ENDP                          459
#define ENDP0                         460
#define ENDP1                         461
#define ENDP2                         462
#define ENDP3                         463
#define UCON                          464
#define SUSPND                        465
#define RESUME                        466
#define USBEN                         467
#define PKTDIS                        468
#define SE0                           469
#define PPBRST                        470
#define DMABCH                        471
#define DMACNTHB                      472
#define DMABCL                        473
#define DMACNTLB                      474
#define RXADDRH                       475
#define DMARCPTRHB                    476
#define RXADDRL                       477
#define DMARCVPTRLB                   478
#define TXADDRH                       479
#define DMATXPTRHB                    480
#define TXADDRL                       481
#define DMATXPTRLB                    482
#define PMDIN1L                       483
#define PMDIN1L_DATAL                 484
#define PMDIN1H                       485
#define PMDIN1H_DATAH                 486
#define PMADDRL                       487
#define ADDRL                         488
#define PMDOUT1L                      489
#define PMADDRH                       490
#define CS1                           491
#define PMDOUT1H                      492
#define CMSTAT                        493
#define COUT1                         494
#define COUT2                         495
#define SSP2CON2                      496
#define SEN2                          497
#define SSP2CON2_SEN                  498
#define ADMSK12                       499
#define SSP2CON2_RSEN                 500
#define RSEN2                         501
#define SSP2CON2_ADMSK1               502
#define ADMSK22                       503
#define PEN2                          504
#define SSP2CON2_PEN                  505
#define SSP2CON2_ADMSK2               506
#define ADMSK32                       507
#define SSP2CON2_RCEN                 508
#define RCEN2                         509
#define SSP2CON2_ADMSK3               510
#define ACKEN2                        511
#define ADMSK42                       512
#define SSP2CON2_ADMSK4               513
#define SSP2CON2_ACKEN                514
#define ACKDT2                        515
#define ADMSK52                       516
#define SSP2CON2_ACKDT                517
#define SSP2CON2_ADMSK5               518
#define SSP2CON2_ACKSTAT              519
#define ACKSTAT2                      520
#define SSP2CON2_GCEN                 521
